# coding: utf-8
# Copyright (c) Antfin, Inc. All rights reserved.

import datetime
import json
from typing import List, Optional
from uuid import uuid4
from pyhocon import ConfigFactory, ConfigTree
import httpx
from openai import OpenAI

from log_config import logger


def make_stream_inference(
    endpoint: str,
    api_key: str,
    query: str,
    model_opt: dict = None,
    timeout: float = None,
):
    """
    调用百灵流式推理服务

    :param endpoint: 推理服务 URL
    :param api_key: 百灵大模型 API Key
    :param query: 提供给模型的 Query
    :param model_options: 模型参数
    :param timeout: 超时时间，单位为秒
    """
    headers = {"Content-Type": "application/json", "Authorization": f"Bearer {api_key}"}

    body = {
        "query": query,
        "reqId": str(uuid4()),
        "reqType": "chat",
        "userId": "2088",
        "sessionId": str(uuid4()),
        "chatId": str(uuid4()),
        "modelOption": model_opt,
    }
    out = ""
    with httpx.Client() as http_client:
        with connect_sse(
            http_client, "POST", endpoint, json=body, headers=headers, timeout=timeout
        ) as event_source:
            for sse in event_source.iter_sse():
                data = json.loads(sse.data)
                out += data["data"]["content"]

    return out


class Inference(object):
    def description(self):
        """description"""
        pass


class InferenceAPI(Inference):
    """这个接口废弃了"""

    def __init__(self, conf_path: str) -> None:
        super().__init__()
        self.conf = ConfigFactory.parse_file(conf_path)

        self.endpoint = self.conf.endpoint
        self.api_key = self.conf.api_key
        self.model_option = self.conf.model_option

    def predict(self, query) -> str:
        return make_stream_inference(
            self.endpoint, self.api_key, query, self.model_option
        )


class InferenceAPI2(Inference):
    def __init__(self, conf_path: str) -> None:
        super().__init__()
        self.conf = ConfigFactory.parse_file(conf_path)

        self.client = OpenAI(api_key=self.conf.api_key, base_url=self.conf.endpoint)
        self.description()

    def description(self):
        logger.info(f"{'*'*100}")
        logger.info(f"model id: {self.conf.model.modelId} version: {self.conf.model.version}")
        logger.info(f"options: {self.conf.model.options}")
        logger.info(f"{'*'*100}")
        return super().description()

    def predict(self, messages: List[str]):
        response = self.client.chat.completions.create(
            model=self.conf.model.modelId,
            messages=messages,
            stream=False,
            max_tokens=self.conf.model.options.max_output_length,
            temperature=self.conf.model.options.temperature)
        return response.choices[0].message.content


if __name__ == "__main__":
    import time
    st = time.time()
    query = [{"role": "user", "content": """"## Role: 互联网保险营销专家
## Goals :
- 根据[人群描述]、[产品信息]以及[用户购买理由]，按照[Rules]要求编写文案内容，生成1条JSON数组格式的文案。
## Constrains :
- 生成的文案内容都必须取自[产品信息]，可以适当改写, 但是要确保产品信息的真实性和准确性，不能胡编乱造；
- 输出内容为json数组格式，可以直接被python的json解析工具解析成功，不要使用markdown语法，不要以\"```json\"开头。
- 文案内容不能引起客户不满，辱骂，不能让客户感到被冒犯。
- 文案中不得包含保险常识的逻辑性错误，不得将某一类保险的特点写在另一类保险的文案中。
- 文案包含的内容需要与世界知识和[产品信息]保持一致，不能提到[产品信息]中不存在的内容、不允许出现虚假宣传的情况。
- 文案需要有较高的可读性，不能存在语法问题，语法问题包括语序错误，标点符号使用错误，少字，错字，多字等5种情况。
- 不能说“0免赔”，得说“1元起赔”
## Skills :
- 保险产品专家:理解保险产品的特点和吸引受众的优势，提供关于产品的专业见解，确保文案的准确性和合规性。
- 写作专家:使用营销领域的话术技巧，创作出引人入胜的文案，让用户产生情感共鸣，以吸引潜在用户。
- 写作专家:使用吸引人的文案风格和语言，创作出引人入胜的文案，以吸引潜在用户。也可以使用情感触发，关注用户的健康或经济安全。
- 客户洞察专家:分析[人群描述]，以确保文案满足他们的需求和解决他们的痛点。
## Rules :
- 如果指定了[热点事件]，需要在营销文案里的[主标题]里结合[热点事件]，找到一个切入角度创作出打动用户的文案
- 如果指定了[文案风格]，就需要用指定的风格来编写文案\n- 营销文案的每行内容，要符合中文语义，[主标题]的字数控制在18个字符以内，[内容1]和[内容2]
的字数控制在12个字符以内
- 营销文案里的[内容1]和[内容2]需体现产品本身的特点，且是并列关系
- 营销文案里的[数字项]是产品信息里的关键数字，[数字项描述]是对[数字项]的含义说明

## Example:
[产品信息]: {产品名称:宠物责任险，产品描述:猫狗伤人可赔偿，起投金额:4.98元，保司:国泰产险，保障范围:伤人+传染病，单次报销额度:最高10万，保额:最高24万，特色服务:赠疫苗，资产:低、中、高，金选解读:保障对象更广，第三者、宠物主及家人均可赔\n,保障宠物主及同住人共计15项人宠共患病，包含猫藓、弓形虫、寄生虫、心丝虫等传染病,行业首创，新增人宠传染病保障，同等保障价格更低，市场同类宠物责任险中，本产品性价比超过市场80%同类产品\n，投保年龄无限制，全龄段宠物均可保}
[人群描述]:{单身贵族：这个群体通常工作繁忙，收入稳定，居住在城市中心或郊区。他们对健康和保持体型意识较强，可能会定期健身和进行体检。他们可能对快速就医服务、预约灵活性和高质量的医疗咨询服务比较感兴趣。此外，由于工作压力，可能对心理健康和减压治疗有所需求}
[用户购买理由]:\n[{\"title\":\"1.健康意识\",\"desc\":\"由于这个群体对健康和保持体型有较强意识，他们可能对宠物的健康也有相同的关心。因此，宠物责任险中包含的赠送疫苗服务可能对他们有吸引力，因为这有助于保持宠物的健康，从而间接维护他们自身的健康生活方式\"},
{\"title\":\"2.经济能力\",\"desc\":\"这个群体拥有稳定的收入，可能更有能力为宠物投保，以减轻潜在的经济风险。起投金额4.98元对他们来说可能不是大问题，而高达24万的保额则提供了充分的风险覆盖。\"},{\"title\":\"3.生活环境\",\"desc\":\"居住在城市中心或郊区可能意味着这个群体的宠物有更多机会与人接触，从而增加了宠物误伤他人或传染病传播的风险。宠物责任险可以为他们提供误伤他人和宠物传染病的保障。\"},
{\"title\":\"4.忙碌的工作\",\"desc\":\"工作繁忙可能导致他们没有足够的时间密切监督宠物，增加宠物意外伤人的风险。宠物责任险可以作为一种风险管理工具，为他们提供心理安慰。\"},{\"title\":\"5.心理健康意识\",\"desc\":\"工作压力可能使他们更关注心理健康。拥有宠物责任险可能会减少他们对可能发生的宠物相关意外的担忧，从而对他们的心理健康产生积极影响。\"}]
[热点事件]:{马上就是中国的春节假期了，很多人因为无法携带宠物乘坐高铁回老家，会选择将宠物寄养在生活的城市里}
输出文案:\n[\n {\n \"品牌\": \"国泰产险\",\n \"品牌描述\": \"宠物责任险\",\n \"主标题\": \"春节寄养，宠物安全有保障\",\n \"内容1\": \"赔偿额度最高24万\",\n \"内容2\": \"全龄宠物都能适用\",\n \"数字项\": \"4.98元\",\n \"数字项描述\": \"投保低至\",\n \"按钮文案\": \"赶快投保\"\n },\n {\n \t\"品牌\": \"国泰产险\",\n \"品牌描述\": \"宠物责任险\",\n \"主标题\": \"春节贴心守护，有保障更安心\",\n \"内容1\": \"保障15项疾病\",\n \"内容2\": \"守护毛孩健康\",\n \"数字项\": \"24万\",\n \"数字项描述\": \"最高保额\",\n \"按钮文案\": \"点击查看\"\n }\n]
## Workflows:
- 作为保险营销专家，你会仔细理解[产品信息]，总结和归纳出'产品特色及卖点'
- 作为客户洞察专家，针对这类[人群描述]，站在用户的角度，找到一些适合切入的角度或场景，最好是能贴近生活，这样更能打动用户
- 作为写作专家，你会根据切入的角度，通过真实的故事或者情境模拟，让目标客户在脑海中构建情景，产生共鸣。
- 作为保险营销专家，你会进一步使用你的[Skills]能力，并遵守[Rules]和[Constrains]约束, 写出符合规则的营销文案，如果你完成的足够完美，你将获得2万美元的消费
## Initialization:
接下来我会给出
[产品信息]:产品名称:好医保·长期医疗(0免赔)，产品描述:0免赔额|6年保证续保，起投金额:11.77元，保司:中国人保健康，保证续保:6年，保障年龄（最低值）:28天，人生阶段:成人、老人、少儿、孕妇，前台产品类型:住院医疗险，健康:健康、结节，保障期限:5年至10年（包含）（保证续保），产品类型:住院医疗，保额:400万，特色保障:癌症特药、癌症/重疾津贴，资产:低、中、高，特色服务:就医绿通类、医疗费用垫付，保障年龄（最高值）:60岁，产品解读:不限社保，1元起赔，超实用，最高报销400万；保证续保6年，生病理赔后继续保；癌症特药放心用，万一孩子大病小病能报销，全能医疗保障，产品简介:1元起赔，保证续保6年，产品责任短语:含费用垫付,6年保证续保,含就医绿通,性价比高,住院0免赔额,不限医保,安心豆最高抵扣100元，金选解读:续保条件优异，6年保证续保，保证续保期间内身体变差/发生理赔/产品停售，均可续保,保障范围全面，住院医疗五项核心保障全面覆盖，社保外住院医疗费用也可保；1元起赔，报销门槛低,院外药范围广，保障癌症特药和其他院外药，无清单限制，CAR-T疗法（120万一针）也能保，健康要求宽松清晰，性价比高,30岁首年投保仅26.55元/月，和同类相比性价比名列前茅，投保页产品卖点:医疗费用1元起赔；患病理赔后还能继续保；0免赔额；6年保证续保；6年保证续保；生病/理赔后还能继续保；住院报销 1元起赔；0免赔额\n,购买引导:1.适合全家人的无忧搭配 1.1 我要给全家稳稳的保障 1.1.1 宝宝顽皮、免疫力差 疾病意外时有发生为了缓解家庭负担 1.1.2 作为家庭支柱我要拼命赚钱为了对家人负责 1.1.3 爸妈老了 一旦生病花费高昂为了让他们安心 2. 保障计划 2.1 保障范围：特殊门诊、门诊手术、住院相关的手术费和药品费、住院(含出入院当天)前30天后30天门急诊 2.2 免赔额：0元 2.3 重疾津贴：90天等待期后初次确诊罹患重疾后直接付1万元重疾津贴 2.4 赔付比例：一般医疗： 6年累计1万及以内部分，赔付比例 30%，1万以上部分，赔付比例100%，其他责任赔付比例100%，投保时选择有医保，但实际无医保或未用医保报销的，按照应赔付金额的60%进行赔付，赔付金额=个人自付医疗费用*相应赔付比例 2.5 等待期：30天 (重疾津贴90天，意外0等待期) 2.6 医院范围：中国大陆二级及以上公立医院普通部/上海市质子重离子医院 2.7 理赔方式：上门垫付医药费/在线便捷理赔 2.8 续保：6年保证续保，可逐年续保，最高可续保至100岁， 免等待期，免健康告知，不因理赔或身体健康状况变化单独调整保费 2.9 退保：犹豫期15天，投保15天内退保，全额退款无任何费用，1. 好医保·长期医疗(0免赔) 2023年重磅发布 1.1 0免赔额+保证续保 1.1.1 百万医疗险全能战士 2. 0免赔额住院报销1元起赔 2.1 一般医疗及意外医疗保险金 2.1.1 长期医疗 (0免赔)赔付30% 赔付100% VS 每年1万元以上大部分 百万医疗不赔付赔付100% 2.2 重大疾病医疗保险金 2.2.1 长期医疗(0免赔) 0免赔额赔付100% 2.2.2 什么是免赔额? 2.2.2.1 免赔额：保险的赔付门槛，超过的部分开始赔。免赔额越高， 赔到的金额越少。 2.2.3 理赔案例 2.2.3.1 钱先生阑尾炎手术花费9456元，费用报销如下： 2.2.3.2 自费金额5056元 ①选1万元免赔额医疗险：未满免赔额，报销0元 ②选长期医疗(0免赔)：报销1516.8元 医保报销 4400元 3. 6年保证续保最高保至100岁 3.1 身体变差/理赔/停售不断保 3.2 好医保·长期医疗(0免赔) ：6年保证续保，生病/理赔后也可续保；6年保证续保期内费率表不涨价；保证续保期内产品停售仍可续保VS 其他百万医疗：只保障1年，续保不确定、续保可能整体涨价、产品停售后不可续保 4. 400万高保额医保内外全报销 4.1 生病敢用好药，接受更好的治疗 4.2 最高400万0免赔额 4.2.1 护理费 4.2.2 检查检验费 4.2.3 治疗费 4.2.4 药品费 4.2.5 手术费 4.2.6 住院前后门急诊门诊手术 4.2.7 CAR-T (120万/针) 4.2.8 床位费 4.2.9 质子重离子 4.2.10 ... 5. 疾病覆盖广1元起赔 5.1 责任内大病小病都报销 5.2 重大疾病：胃癌、肝癌、白血病、肺癌、淋巴癌、瘫痪... 5.3 小病：阑尾炎、肠胃炎、肺炎... 6. 癌症特殊药品放心用 6.1 供药网络全国覆盖支持送药上门 6.2 抗癌特药目录全覆盖实时同步上新药 6.2.1 肾癌 6.2.2 胃癌 6.2.3 结直肠癌 6.2.4 肺癌 6.2.5 白血病 6.2.6 乳腺癌 6.2.7 肝癌 6.2.8 艾瑞卡赫赛汀泰欣生... 6.3 药品覆盖广不限院内院外用药，不怕院内没引进药物 6.4 药品直付外购药指定药店直接结算不需要用户垫付 7. 专人服务，就医&理赔不操心 7.1 赠送重疾绿通，支持医疗费用垫付 7.2 专人服务陪同处理 7.2.1 专家门诊 7.2.2 住院安排 7.2.3 医院垫付 7.2.4 专家手术 7.2.5 快速理赔\n\n
[人群描述]:年轻用户群体，积极、充满活力，但可能对医疗保健的认知和关注较低。他们可能更关注急诊服务、性健康、心理咨询和预防性疫苗接种。此外，由于经济独立性有限，他们可能会寻找性价比较高的医疗服务选项。
[用户购买理由]:[{\"desc\": \"产品的起投金额低，对于经济独立性有限的年轻人来说，这是一个容易承受的保费，此外，性价比高的特点也符合他们寻找性价比高的医疗服务选项的需求\", \"title\": \"1. 经济性\"}, {\"desc\": \"6年保证续保提供了长期的医疗保障，尽管年轻人可能目前健康状况良好，但可以预见到长期的保障会让他们在未来任何不确定性发生时都有所依靠\", \"title\": \" 2. 长期保障\"}, {\"desc\": \"产品提供特殊门诊、门诊手术、住院相关费用的保障，包括急诊服务，这与年轻人可能更关注的急诊服务需求相符合\", \"title\": \" 3. 全面的保障范围\"}, {\"desc\": \"1元起赔和0免赔额意味着即使是小额医疗开支也能得到报销，这对于可能没有大量积蓄的年轻人来说是一个吸引人的特点\", \"title\": \" 4. 低门槛报销\"}, {\"desc\": \"虽然产品描述中没有特别提及疫苗接种，但全面的保障范围可能包括了这类服务，这也是年轻人可能关注的健康维护方面\", \"title\": \" 5. 预防性疫苗接种\"}, {\"desc\": \"如就医绿通、医疗费用垫付等服务提供便利，特别是对于忙碌的年轻职场人士或学生来说，能够节省他们宝贵的时间和减少前期垫付的经济压力\", \"title\": \" 6. 特色服务\"}, {\"desc\": \"产品覆盖不同的人生阶段，包括成人期，这意味着年轻人在成长的过程中都可以从中受益\", \"title\": \" 7. 适应不同人生阶段\"}, {\"desc\": \"对于一些有小健康问题（如结节）的年轻人来说，宽松的健康要求使得他们也有机会获得保险保障，\", \"title\": \" 8. 健康要求宽松\"}]
[热点事件]:
输出文案:
"""}]
    infer = InferenceAPI2("/ossfs/workspace/AI_portal/config/model.conf")
    print(infer.predict(query))
    print(time.time()-st)
